BDF4_project/tutorials/onedim_sine_wave/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (0 0 0)     // 0
    (2 0 0)     // 1
    (2 0.1 0)   // 2
    (0 0.1 0)   // 3
    (0 0 0.1)   // 4
    (2 0 0.1)   // 5
    (2 0.1 0.1) // 6
    (0 0.1 0.1) // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (800 1 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    left
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    right
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    frontBackUpDown
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
            (2 3 7 6)
            (0 1 5 4)
        );
    }
);


// ************************************************************************* //
